<!-- dflook/terraform-github-actions {"workspace":"home","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"14d9ef936b90ffc802b670964226ed9af0e052fe5a513366db872d5627f863ee","plan_job_ref":"Job Test plan target and replace #380 at https://github.com/dflook/terraform-github-actions/actions/runs/7188164876","plan_hash":"99d1d09e325635a26eee2fabe89376dd6f53d693f1160c4d887e280514b93c8e","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __home__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "eWvyF2KxHS" -> (known after apply)
  ~ foreach = "xjoVs41dPe" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #380](https://github.com/dflook/terraform-github-actions/actions/runs/7188164876)